app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title") VALUES (?)  [["title", "Biology"]]
---
    def create
        @school_class = SchoolClass.create(params_school_class(:title, :rooom_number))